[
    {
        "id": 1,
        "tag": "School Project",
        "title": "Job Tracker",
        "collaborators": [
            {
                "name": "Thomas Murray",
                "github": "https://github.com/tmurr"
            },
            {
                "name": "Chengjie Shen",
                "github": "https://github.com/scjshen"
            }
        ],
        "context": "Developed for my Capstone Project course at Oregon State University.",
        "description": "Job Tracker is a web application designed to help users manage their job search process. It allows users to track job applications, their skills, and contacts.\\nThe application features a user-friendly interface with a dashboard that displays the status of each job application, and a skills dashboard to track how often skills are mentioned in applications.",
        "technologies": [
            "JavaScript",
            "HTML",
            "CSS",
            "Express",
            "MySQL",
            "React",
            "Tailwind",
            "JWT"
        ],
        "images": [
            "job_tracker.png"
        ],
        "repoURL": "https://github.com/sirus-the-beaver/job-tracker",
        "liveDemoURL": "https://job-tracker-steel-kappa.vercel.app/login"
    },
    {
        "id": 2,
        "tag": "Hackathon Project",
        "title": "TikTok Concerts",
        "collaborators": [],
        "context": "Developed for the TikTok TechJam 2024 hackathon.",
        "description": "TikTok Concerts is designed to improve the experience of watching live concerts on TikTok Live. It provides several features to help artists and users connect more easily.",
        "technologies": [
            "Next.js",
            "TypeScript",
            "React",
            "Tailwind",
            "MongoDB",
            "Google Maps API"
        ],
        "images": [
            "tiktok_concerts.png"
        ],
        "repoURL": "https://github.com/sirus-the-beaver/tiktok-concerts",
        "liveDemoURL": "https://tiktok-concerts.vercel.app"
    },
    {
        "id": 4,
        "tag": "School Project",
        "title": "Hashmap Data Structure Implementation",
        "collaborators": [],
        "context": "Developed for my Data Structures course at Oregon State University.",
        "description": "I completed the implementation of a hash map using 2 different methods.\\nThe first method used is separate chaining where linked lists are used for collision resolution and the underlying structure of the hash table is a dynamic array.\\nThe second method used is open addressing with quadratic probing for collision resolution and the underlying structure of the hash table is a dynamic array.",
        "technologies": [
            "Python"
        ],
        "images": [
            "quadratic_probing_hashmap.png"
        ],
        "repoURL": "https://github.com/sirus-the-beaver/HashMap",
        "liveDemoURL": ""
    },
    {
        "id": 6,
        "tag": "Hackathon Project",
        "title": "Playlist Generator",
        "collaborators": [],
        "context": "Developed for the RoseHack 2024 hackathon hosted by the Univeristy of California, Riverside.",
        "description": "Developed a Playlist Generator web application with a Flask backend, enabling efficient music playlist creation and management.\\nUtilized traditional HTML, CSS, and JavaScript to design and implement the frontend, ensuring a seamless and user-friendly interface. Integrated the Spotify API for dynamic music data retrieval, providing users with up-to-date music selections and playlist management capabilities.",
        "technologies": [
            "Python",
            "Flask",
            "JavaScript",
            "HTML",
            "CSS"
        ],
        "images": [
            "playlist_generator.png"
        ],
        "repoURL": "https://github.com/sirus-the-beaver/playlist-generator",
        "liveDemoURL": "https://playlist-generator-app-0978b3df1fbd.herokuapp.com/"
    },
    {
        "id": 7,
        "tag": "School Project",
        "title": "x86 Assembly IO Procs",
        "collaborators": [],
        "context": "Developed for my Computer Architecture and Assembly Language course at Oregon State University.",
        "description": "This project uses lower-level programming concepts such as memory addressing/management and pointers to convert user-inputted numbers (represented in ASCII) to their literal numerical value and then reconvert these literal numerical values back to ASCII so that they can be outputted to the screen.\\nThe program also calculates the sum and average of the numbers inputted by the user, and displays their value to the output.\\nThis program intentionally incorporates the use of macros to handle getting user input and displaying output.\\nProcedures are used for handling converting the string of ASCII code to a decimal representation, storing these decimal values in an array, and then another procedure handles converting the values in the array back to ASCII code so they can be outputted to the screen.\\nThis code is written in x86 Assembly in MASM syntax meant for the Microsoft assembler.",
        "technologies": [
            "x86 Assembly"
        ],
        "images": [
            "read_val_proc.png"
        ],
        "repoURL": "https://github.com/sirus-the-beaver/x86assembly-io-procs",
        "liveDemoURL": ""
    }
]